[Rainmeter]
Update=1000
AccurateText=0
DynamicWindowSize=0
Group=PRTSkin | PRTSkinHidable

OnCloseAction=[!ShowFade "#ROOTCONFIG#\VoiceBox"]

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|语音记录文本框。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#ROOTCONFIGPATH#VoiceBox\Notes.ini
@Include2=#AssistantPath#Config.inc

VoLineError=I AM#CRLF#ERROR.
VoLineGreet=#VoLineError#
VoDuraGreet=0
VoDuraCountdown=0


[mVoiceBoxClose]
Measure=Calc
Formula=#VoDuraCountdown#-1
DynamicVariables=1
OnUpdateAction=[!SetVariable VoDuraCountdown "[mVoiceBoxClose]"]
IfCondition=#VoDuraCountdown# <= -3
IfTrueAction=[!DeactivateConfig]


;语音记录文本框
;背景
[VoiceBoxBg]
LeftMouseUpAction=[PlayStop][!DeactivateConfig "#CURRENTCONFIG#"]

;文本 ;"现在还不能休息哦。"
[VoiceBoxText]
Text=#VoLineError#

;移除输入框
[mVoiceBoxInput]
Hidden=1


;左上角标签
[VoiceBoxLabelBg]

[VoiceBoxLabel]
Text=VOICE


;下箭头
[VoiceBoxNext]